**** DONE tc_204 rate_meter_rx trigger mac_tx gen pause has bug, the interval of ON type pause is so closed. it's 200us, the expect value is 2ms.
     CLOSED: [2018-07-12 Thu 14:51]
     - State "DONE"       from "STARTED"    [2018-07-12 Thu 14:51]
     :LOGBOOK:  
     CLOCK: [2018-07-12 Thu 11:10]--[2018-07-12 Thu 14:51] =>  3:41
     :END:      
     Tonny remove the progma translate_off/on for the fast simulation.
*** DONE tc_209 Line side mac_tx port shaper function (by rate_meter_multiple module) test.[100%]
    CLOSED: [2018-08-22 Wed 09:16]
    - State "DONE"       from "TODO"       [2018-08-22 Wed 09:16]
    - State "TODO"       from "DONE"       [2018-07-19 Thu 14:58]
    - State "DONE"       from "STARTED"    [2018-07-16 Mon 16:43]
    - State "STARTED"    from "DONE"       [2018-07-12 Thu 14:57]
    - State "DONE"       from "STARTED"    [2018-07-09 Mon 18:08]
   :LOGBOOK:  
   CLOCK: [2018-07-09 Mon 17:07]--[2018-07-09 Mon 17:45] =>  0:38
   CLOCK: [2018-07-09 Mon 15:51]--[2018-07-09 Mon 16:11] =>  0:20
   :END:      
    double check the output rate for fixed size packet. it should almost equal the setting rate.
    <2018-08-22 Wed 09:13> After correcting the CLOCK1X_FREQUENCY to 177_777_778, the rate of output traffic is equal the prov value. so it pass.
**** DONE SYS side DRIVER/MONITOR don't respond BP, DUT segbuf will overflow, DUT should not send out the fragment of packet.
     CLOSED: [2018-07-09 Mon 17:45]
     - State "DONE"       from "STARTED"    [2018-07-09 Mon 17:45]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 16:32]--[2018-07-09 Mon 16:43] =>  0:11
    :END:      
    tc_209
** DONE Port based lookback testcase updating [100%]
   CLOSED: [2018-06-06 Wed 14:52]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:52]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 14:26]--[2018-06-06 Wed 14:52] =>  0:26
   :END:      
*** DONE tc_300
    CLOSED: [2018-06-06 Wed 14:08]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:08]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 12:17]--[2018-06-06 Wed 12:22] =>  0:05
    :END:      
*** DONE tc_300_lab
    CLOSED: [2018-06-06 Wed 14:10]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:10]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:08]--[2018-06-06 Wed 14:10] =>  0:02
    :END:      
*** DONE tc_301
    CLOSED: [2018-06-06 Wed 14:24]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 14:24]
    :LOGBOOK:  
    CLOCK: [2018-06-06 Wed 14:10]--[2018-06-06 Wed 14:24] =>  0:14
    :END:      
** DONE vlan_det_lookup device level test. [100%]
   CLOSED: [2018-06-06 Wed 17:42]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 17:42]
   - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:12]
   - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:57]
   :LOGBOOK:  
   CLOCK: [2018-06-06 Wed 17:38]--[2018-06-06 Wed 17:42] =>  0:04
   CLOCK: [2018-05-30 Wed 12:20]--[2018-05-30 Wed 12:21] =>  0:01
   CLOCK: [2018-05-30 Wed 12:13]--[2018-05-30 Wed 12:14] =>  0:01
   CLOCK: [2018-05-30 Wed 11:51]--[2018-05-30 Wed 11:59] =>  0:08
   CLOCK: [2018-05-30 Wed 11:32]--[2018-05-30 Wed 11:49] =>  0:17
   :END:      
**** DONE tc_302 vlan based fac loobpack [100%]
     CLOSED: [2018-06-06 Wed 11:56]
     - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
     - State "STARTED"    from "DONE"       [2018-05-31 Thu 17:21]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:23]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 17:21]--[2018-05-31 Thu 17:22] =>  0:01
     CLOCK: [2018-05-31 Thu 16:01]--[2018-05-31 Thu 16:09] =>  0:08
     CLOCK: [2018-05-31 Thu 15:54]--[2018-05-31 Thu 15:57] =>  0:03
     CLOCK: [2018-05-31 Thu 15:38]--[2018-05-31 Thu 15:43] =>  0:05
     CLOCK: [2018-05-31 Thu 14:50]--[2018-05-31 Thu 15:20] =>  0:30
     CLOCK: [2018-05-31 Thu 09:45]--[2018-05-31 Thu 09:46] =>  0:01
     CLOCK: [2018-05-30 Wed 17:32]--[2018-05-30 Wed 17:38] =>  0:06
     CLOCK: [2018-05-30 Wed 17:08]--[2018-05-30 Wed 17:16] =>  0:08
     CLOCK: [2018-05-30 Wed 16:23]--[2018-05-30 Wed 16:27] =>  0:04
     :END:      
***** DONE more traffic input to lookup based on matchId 63. 
      CLOSED: [2018-06-01 Fri 09:26]
      - State "DONE"       from "STARTED"    [2018-06-01 Fri 09:26]
      - State "STARTED"    from "DONE"       [2018-06-01 Fri 09:25]
      - State "DONE"       from "STARTED"    [2018-05-31 Thu 18:11]
      :LOGBOOK:  
      CLOCK: [2018-06-01 Fri 09:25]--[2018-06-01 Fri 09:26] =>  0:01
      CLOCK: [2018-05-31 Thu 18:00]--[2018-05-31 Thu 18:11] =>  0:11
      CLOCK: [2018-05-31 Thu 17:43]--[2018-05-31 Thu 17:48] =>  0:05
      CLOCK: [2018-05-31 Thu 17:23]--[2018-05-31 Thu 17:41] =>  0:18
      :END:      
      phy1 input 51 flows, flow11--flow20 are untagged l2cp frame, they are exception. others will do flow based loopback.
***** DONE more matchId provisioning.
      CLOSED: [2018-06-06 Wed 11:56]
      - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
      :LOGBOOK:  
      CLOCK: [2018-06-06 Wed 11:49]--[2018-06-06 Wed 11:56] =>  0:07
      CLOCK: [2018-06-06 Wed 11:19]--[2018-06-06 Wed 11:37] =>  0:18
      CLOCK: [2018-06-06 Wed 10:06]--[2018-06-06 Wed 10:30] =>  0:24
      CLOCK: [2018-06-06 Wed 09:02]--[2018-06-06 Wed 09:11] =>  0:09
      CLOCK: [2018-06-06 Wed 08:36]--[2018-06-06 Wed 08:53] =>  0:17
      CLOCK: [2018-06-05 Tue 18:32]--[2018-06-05 Tue 19:09] =>  0:37
      CLOCK: [2018-06-05 Tue 17:38]--[2018-06-05 Tue 18:14] =>  0:36
      CLOCK: [2018-06-05 Tue 16:51]--[2018-06-05 Tue 17:28] =>  0:37
      CLOCK: [2018-06-05 Tue 16:28]--[2018-06-05 Tue 16:42] =>  0:14
      CLOCK: [2018-06-05 Tue 15:48]--[2018-06-05 Tue 16:02] =>  0:14
      CLOCK: [2018-06-05 Tue 15:43]--[2018-06-05 Tue 15:45] =>  0:02
      CLOCK: [2018-06-05 Tue 14:30]--[2018-06-05 Tue 14:40] =>  0:10
      CLOCK: [2018-06-05 Tue 12:21]--[2018-06-05 Tue 12:23] =>  0:02
      CLOCK: [2018-06-05 Tue 12:08]--[2018-06-05 Tue 12:16] =>  0:08
      CLOCK: [2018-06-05 Tue 11:56]--[2018-06-05 Tue 12:00] =>  0:04
      CLOCK: [2018-06-05 Tue 11:23]--[2018-06-05 Tue 11:39] =>  0:16
      CLOCK: [2018-06-05 Tue 09:23]--[2018-06-05 Tue 09:32] =>  0:09
      CLOCK: [2018-06-05 Tue 09:00]--[2018-06-05 Tue 09:12] =>  0:12
      CLOCK: [2018-06-01 Fri 18:20]--[2018-06-01 Fri 18:26] =>  0:06
      CLOCK: [2018-06-01 Fri 17:56]--[2018-06-01 Fri 18:01] =>  0:05
      CLOCK: [2018-06-01 Fri 17:12]--[2018-06-01 Fri 17:44] =>  0:32
      CLOCK: [2018-06-01 Fri 16:19]--[2018-06-01 Fri 17:06] =>  0:47
      CLOCK: [2018-06-01 Fri 16:06]--[2018-06-01 Fri 16:11] =>  0:05
      CLOCK: [2018-06-01 Fri 14:22]--[2018-06-01 Fri 14:40] =>  0:18
      CLOCK: [2018-06-01 Fri 11:54]--[2018-06-01 Fri 12:28] =>  0:34
      CLOCK: [2018-06-01 Fri 11:53]--[2018-06-01 Fri 11:54] =>  0:01
      :END:      
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302a][tc_302a]]  
      every port have flow based loopback.[[file:xg480_phy_verify_notes.org::tc_302b][tc_302b]]  
***** DONE tc_302b fail, need desinger to debug.
      CLOSED: [2018-07-11 Wed 17:42]
      - State "DONE"       from "STARTED"    [2018-07-11 Wed 17:42]
      :LOGBOOK:  
      CLOCK: [2018-07-11 Wed 16:31]--[2018-07-11 Wed 16:35] =>  0:04
      CLOCK: [2018-07-11 Wed 15:29]--[2018-07-11 Wed 16:21] =>  0:52
      :END:      
**** DONE tc_303 vlan based terminal loopback
     CLOSED: [2018-07-13 Fri 15:31]
     - State "DONE"       from "STARTED"    [2018-07-13 Fri 15:31]
     :LOGBOOK:  
     CLOCK: [2018-07-13 Fri 14:51]--[2018-07-13 Fri 15:31] =>  0:40
     :END:      
*** DONE align the testcase from 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 17:06]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:06]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 16:47]--[2018-05-30 Wed 17:03] =>  0:16
    :END:      
    - [X] tc_302
**** DONE re-run tc_302 on 10g device TB
     CLOSED: [2018-05-31 Thu 16:45]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 16:36]--[2018-05-31 Thu 16:43] =>  0:07
     CLOCK: [2018-05-31 Thu 16:24]--[2018-05-31 Thu 16:32] =>  0:08
     :END:      
     it's pass. need add more traffic flows, to generate more condiction to run this case
*** DONE port_proc_ingress [100%]
    CLOSED: [2018-09-10 Mon 11:11]
    - State "DONE"       from "STARTED"    [2018-09-10 Mon 11:11]
    :LOGBOOK:  
    CLOCK: [2018-09-04 Tue 14:08]--[2018-09-04 Tue 18:17] =>  4:09
    CLOCK: [2018-09-04 Tue 12:08]--[2018-09-04 Tue 12:26] =>  0:18
    :END:      
**** DONE provisioning method
     CLOSED: [2018-09-06 Thu 11:18]
     - State "DONE"       from "STARTED"    [2018-09-06 Thu 11:18]
     :LOGBOOK:  
     CLOCK: [2018-09-04 Tue 11:48]--[2018-09-04 Tue 12:03] =>  0:15
     :END:      
**** DONE transfer function
     CLOSED: [2018-09-06 Thu 15:23]
     - State "DONE"       from "STARTED"    [2018-09-06 Thu 15:23]
     :LOGBOOK:  
     CLOCK: [2018-09-06 Thu 11:18]--[2018-09-06 Thu 15:09] =>  3:51
     :END:      
**** DONE tc_030 Ingress to test pcpDecoder and push pvid, swap priVid
     CLOSED: [2018-09-07 Fri 16:46]
     - State "DONE"       from "STARTED"    [2018-09-07 Fri 16:46]
     :LOGBOOK:  
     CLOCK: [2018-09-07 Fri 15:43]--[2018-09-07 Fri 16:46] =>  1:03
     CLOCK: [2018-09-07 Fri 14:19]--[2018-09-07 Fri 15:02] =>  0:43
     :END:      
*** DONE port_proc_egress [100%]
    CLOSED: [2018-09-10 Mon 11:11]
    - State "DONE"       from "STARTED"    [2018-09-10 Mon 11:11]
    :LOGBOOK:  
    CLOCK: [2018-09-06 Thu 16:58]--[2018-09-06 Thu 17:59] => 1:01
    :END:      
*** DONE testcase setup [100%]
    CLOSED: [2018-06-26 Tue 18:06]
    - State "DONE"       from "STARTED"    [2018-06-26 Tue 18:06]
    - State "STARTED"    from "DONE"       [2018-06-26 Tue 18:01]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 15:00]
    - State "STARTED"    from "DONE"       [2018-06-06 Wed 12:13]
    - State "DONE"       from "STARTED"    [2018-06-06 Wed 11:56]
    :LOGBOOK:  
    CLOCK: [2018-06-26 Tue 18:01]--[2018-06-26 Tue 18:05] =>  0:04
    CLOCK: [2018-06-06 Wed 11:39]--[2018-06-06 Wed 11:49] =>  0:10
    CLOCK: [2018-06-06 Wed 09:59]--[2018-06-06 Wed 10:04] =>  0:05
    CLOCK: [2018-06-06 Wed 09:23]--[2018-06-06 Wed 09:53] =>  0:30
    CLOCK: [2018-06-06 Wed 08:59]--[2018-06-06 Wed 09:02] =>  0:03
    :END:      
    - [X] [[file:xg480_phy_verify_notes.org::tc_507][tc_507]], based tc_007 and tc_500, 100G mode ptp testcase
** DONE 100g CGMII interface [100%]
   CLOSED: [2018-06-15 Fri 18:02]
   - State "DONE"       from "STARTED"    [2018-06-15 Fri 18:02]
   :LOGBOOK:  
   CLOCK: [2018-06-14 Thu 11:10]--[2018-06-14 Thu 14:00] =>  2:50
   :END:      
   integrating the cgmii driver/monitor into TB/TB_ENV
*** DONE CGMII Monitor [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-05 Tue 16:02]--[2018-06-05 Tue 16:05] =>  0:03
    CLOCK: [2018-06-05 Tue 14:52]--[2018-06-05 Tue 14:53] =>  0:01
    CLOCK: [2018-06-05 Tue 14:40]--[2018-06-05 Tue 14:45] =>  0:05
    CLOCK: [2018-06-05 Tue 12:16]--[2018-06-05 Tue 12:21] =>  0:05
    CLOCK: [2018-06-05 Tue 12:02]--[2018-06-05 Tue 12:08] =>  0:06
    :END:      
    - [X] CGMII RX SPEC and RTL [2/2]
      - [X] SPEC: the SPEC has been ready, Leo committed it.<2018-05-30 Wed> 
      - [X] RTL: it has been ready <2018-05-30 Wed> 
    - [X] UVM monitor 
*** DONE CGMII Driver [100%]
    CLOSED: [2018-06-13 Wed 11:38]
    - State "DONE"       from "STARTED"    [2018-06-13 Wed 11:38]
    :LOGBOOK:  
    CLOCK: [2018-06-13 Wed 10:55]--[2018-06-13 Wed 11:38] =>  0:43
    CLOCK: [2018-06-13 Wed 09:29]--[2018-06-13 Wed 09:47] =>  0:18
    CLOCK: [2018-06-07 Thu 10:22]--[2018-06-07 Thu 11:29] =>  1:07
    CLOCK: [2018-06-07 Thu 09:38]--[2018-06-07 Thu 10:02] =>  0:24
    CLOCK: [2018-06-07 Thu 09:01]--[2018-06-07 Thu 09:26] =>  0:25
    CLOCK: [2018-06-06 Wed 16:44]--[2018-06-06 Wed 16:59] =>  0:15
    CLOCK: [2018-06-06 Wed 15:17]--[2018-06-06 Wed 15:25] =>  0:08
    CLOCK: [2018-06-05 Tue 17:33]--[2018-06-05 Tue 17:38] =>  0:05
    CLOCK: [2018-06-05 Tue 16:42]--[2018-06-05 Tue 16:51] =>  0:09
    CLOCK: [2018-06-05 Tue 16:21]--[2018-06-05 Tue 16:28] =>  0:07
    CLOCK: [2018-06-05 Tue 16:05]--[2018-06-05 Tue 16:15] =>  0:10
    :END:      
    - [X] CGMII TX [2/2]
      - [X] SPEC
      - [X] RTL
    - [X] UVM Driver 
**** DONE sgmii east/west backpressure out/in pin. tc_1001
     CLOSED: [2018-06-26 Tue 17:46]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 17:46]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 15:47]--[2018-06-26 Tue 17:11] =>  1:24
     :END:      
     sgmiiEastRxBackpressureOut,
     sgmiiEastTxBackpressureIn,
     sgmiiWestRxBackpressureOut,
     sgmiiWestTxBackpressureIn
     In top.sv connect the output to input, then write the internal register with 1/0, read the input indication register.
**** DONE gasicParityInOut, gasicParityErrOut tc_1001
     CLOSED: [2018-06-26 Tue 17:55]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 17:55]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 17:46]--[2018-06-26 Tue 17:55] =>  0:09
     :END:      
     input         gasicParityInOut  ,
     input  logic  gasicParityErrOut , // change to input for pin test
     Set those two signal 1/0, read the related indication register on device reg.
**** TODO SFP status and control pin, out pin test fail, need Haidong double check. tc_1001
     - State "TODO"       from "DONE"       [2018-06-27 Wed 14:31]
     - State "DONE"       from "DONE"       [2018-06-27 Wed 14:31]
     - State "DONE"       from "STARTED"    [2018-06-26 Tue 18:26]
     :LOGBOOK:  
     CLOCK: [2018-06-26 Tue 18:07]--[2018-06-26 Tue 18:26] =>  0:19
     :END:      
     input    logic [7:0]          sfpPresentIn_n             ,
     input    logic [7:0]          sfpLosIn                   ,
     input    logic [7:0]          sfpTxFaultIn               ,
     output   logic [7:0]          sfpTxDisableOut            ,
     output   logic [7:0]          sfpModuleSelOut            ,
     output   logic [7:0]          sfpLowPowerModeOut         ,
     For input signal, set them to 1/0, read related indication register on device reg.
     For output signal, write the related regiset on device reg, check/monitor the signal on top.sv/TB.
** DONE PTP full bandwidth. [100%]
   CLOSED: [2018-05-30 Wed 19:24]
   - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
   :LOGBOOK:  
   CLOCK: [2018-05-30 Wed 14:49]--[2018-05-30 Wed 15:08] =>  0:19
   :END:      
*** DONE tc_503 All port input PTP packet with full bandwidth.[100%] 
    CLOSED: [2018-05-30 Wed 19:00]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:00]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 18:32]--[2018-05-30 Wed 18:59] =>  0:27
    CLOCK: [2018-05-30 Wed 18:01]--[2018-05-30 Wed 18:06] =>  0:05
    CLOCK: [2018-05-30 Wed 17:23]--[2018-05-30 Wed 17:31] =>  0:08
    :END:      
    - [X] all inress port input full bandwith traffic with PTP packet.<2018-05-30 Wed 18:59> 
**** DONE TF side need double check.<2018-05-30 Wed 19:26> 
     CLOSED: [2018-05-31 Thu 09:43]
     - State "DONE"       from "STARTED"    [2018-05-31 Thu 09:43]
     :LOGBOOK:  
     CLOCK: [2018-05-31 Thu 09:38]--[2018-05-31 Thu 09:43] =>  0:05
     CLOCK: [2018-05-31 Thu 08:32]--[2018-05-31 Thu 09:21] =>  0:49
     :END:      
    - [X] all egress port input full bandwith traffic with PTP packet, disable overwrite SA on mac_tx.
     when set every flow input 400 packets, there are miscmp errors; Need Tonny to double check it. <2018-05-30 Wed 17:30>
      In the ptp_process spec, about setting updateCorrectField condition is not clear, after disscution with tonny, TF need do modificaiton, if packet is event ptp, and allowopertion, set the updateCorrectField; don't care the egrRxIfPortNum any more. later, tonny wiil update the spec also. 
*** DONE tc_504 All port input PTP and non-PTP packet with full bandwidth.[100%]
    CLOSED: [2018-05-30 Wed 19:07]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:07]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:00]--[2018-05-30 Wed 19:07] =>  0:07
    CLOCK: [2018-05-30 Wed 16:21]--[2018-05-30 Wed 16:22] =>  0:01
    CLOCK: [2018-05-30 Wed 15:58]--[2018-05-30 Wed 16:10] =>  0:12
    CLOCK: [2018-05-30 Wed 15:54]--[2018-05-30 Wed 15:55] =>  0:01
    :END:      
    - [X] all egress port input full bandwidth traffic, PTP and non-PTP, disable overwrite SA on mac_tx.
    - [X] all ingress port input full bandwidth traffic, PTP and non-PTP.<2018-05-30 Wed 19:07> 
*** DONE align the related testcase form 25g device to 10g device [100%]
    CLOSED: [2018-05-30 Wed 19:24]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 19:24]
    - State "TODO"       from "DONE"       [2018-05-30 Wed 19:09]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 17:18]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 19:10]--[2018-05-30 Wed 19:21] =>  0:11
    CLOCK: [2018-05-30 Wed 15:41]--[2018-05-30 Wed 15:42] =>  0:01
    CLOCK: [2018-05-30 Wed 15:31]--[2018-05-30 Wed 15:37] =>  0:06
    CLOCK: [2018-05-30 Wed 15:12]--[2018-05-30 Wed 15:18] =>  0:06
    :END:      
    - [X] tc_503 
    - [X] tc_504
*** DONE Align the all related testcase between xg480_phy_25g and xg480_phy_10g device [100%]
    CLOSED: [2018-05-30 Wed 14:48]
    - State "DONE"       from "STARTED"    [2018-05-30 Wed 14:48]
    :LOGBOOK:  
    CLOCK: [2018-05-30 Wed 14:41]--[2018-05-30 Wed 14:43] =>  0:02
    CLOCK: [2018-05-30 Wed 14:29]--[2018-05-30 Wed 14:37] =>  0:08
    CLOCK: [2018-05-30 Wed 14:04]--[2018-05-30 Wed 14:10] =>  0:06
    CLOCK: [2018-05-30 Wed 11:59]--[2018-05-30 Wed 12:13] =>  0:14
    CLOCK: [2018-05-30 Wed 11:49]--[2018-05-30 Wed 11:50] =>  0:01
    :END:      
    - [X] tc_208
    - [X] tc_208a
*** DONE generation the dyinggasp injection testcase all provisionging
    CLOSED: [2018-05-31 Thu 10:58]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 10:58]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 10:31]--[2018-05-31 Thu 10:39] =>  0:08
    CLOCK: [2018-05-31 Thu 09:48]--[2018-05-31 Thu 10:00] =>  0:12
    :END:      
    based on tc_201b, grep all procWrite.
** DONE align the testcase between xg480_phy_25g and xg480_phy_10g [100%]
   CLOSED: [2018-05-31 Thu 16:45]
   - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:45]
   :LOGBOOK:  
   CLOCK: [2018-05-31 Thu 16:14]--[2018-05-31 Thu 16:18] =>  0:04
   :END:      
*** DONE tc_201b, from 25g to 10g device, dyinggasp injection.
    CLOSED: [2018-05-31 Thu 14:04]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 14:04]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 13:58]--[2018-05-31 Thu 14:02] =>  0:04
    CLOCK: [2018-05-31 Thu 11:04]--[2018-05-31 Thu 11:28] =>  0:24
    :END:      

*** DONE tc_201c, from 25g to 10g device, dyinggasp injection, non-zero time prov.
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:45]--[2018-05-31 Thu 14:49] =>  0:04
    CLOCK: [2018-05-31 Thu 14:31]--[2018-05-31 Thu 14:42] =>  0:11
    CLOCK: [2018-05-31 Thu 14:23]--[2018-05-31 Thu 14:24] =>  0:01
    :END:      
*** DONE tc_201,tc_201a; from 25g to 10g device, pause injection
    CLOSED: [2018-05-31 Thu 15:43]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 15:43]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 14:42]--[2018-05-31 Thu 14:45] =>  0:03
    CLOCK: [2018-05-31 Thu 14:25]--[2018-05-31 Thu 14:31] =>  0:06
    CLOCK: [2018-05-31 Thu 14:07]--[2018-05-31 Thu 14:19] =>  0:12
    :END:      
*** DONE tc_200, from 25g to 10g device, mac_rx/tx basic function testcase
    CLOSED: [2018-05-31 Thu 16:14]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:14]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:11]--[2018-05-31 Thu 16:14] =>  0:03
    CLOCK: [2018-05-31 Thu 15:57]--[2018-05-31 Thu 16:01] =>  0:04
    CLOCK: [2018-05-31 Thu 15:44]--[2018-05-31 Thu 15:54] =>  0:10
    :END:      
*** DONE tc_004a, external reset test. if it set, DUT should do nothing.
    CLOSED: [2018-05-31 Thu 16:44]
    - State "DONE"       from "STARTED"    [2018-05-31 Thu 16:44]
    :LOGBOOK:  
    CLOCK: [2018-05-31 Thu 16:32]--[2018-05-31 Thu 16:36] =>  0:04
    CLOCK: [2018-05-31 Thu 16:20]--[2018-05-31 Thu 16:22] =>  0:02
    :END:      

*** DONE tc_006a, CGMII to LBUS, LBUS to CGMII, 100G, flow0 3000B, flow1 200B, testcase ready
    CLOSED: [2018-06-19 Tue 12:25]
    - State "DONE"       from "STARTED"    [2018-06-19 Tue 12:25]
    :LOGBOOK:  
    CLOCK: [2018-06-12 Tue 08:45]--[2018-06-12 Tue 08:52] =>  0:07
    CLOCK: [2018-06-08 Fri 11:02]--[2018-06-08 Fri 11:19] =>  0:17
    :END:      
    tc_006a, 2flows, 200 and 3000 bytes; it's re-produce the lab issue.
    the issue is the lbus 's ENA is not (1 3 7 or 0xf). Leo has fixed the issue.
*** DONE tc_006b, CGMII to LBUS, LBUS to CGMII, 100G, 64 to 256 random, testcase ready
    CLOSED: [2018-06-08 Fri 17:44]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 17:44]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 17:18]--[2018-06-08 Fri 17:44] =>  0:26
    :END:      
*** DONE tc_006c, CGMII to LBUS, LBUS to CGMII, 100G, 64 to 9600 random, testcase ready
    CLOSED: [2018-06-08 Fri 18:33]
    - State "DONE"       from "STARTED"    [2018-06-08 Fri 18:33]
    :LOGBOOK:  
    CLOCK: [2018-06-08 Fri 18:26]--[2018-06-08 Fri 18:33] =>  0:07
    CLOCK: [2018-06-08 Fri 17:44]--[2018-06-08 Fri 17:49] =>  0:05
    :END:      
**** DONE normal traffic with fac looback tc_309 (100g mode), tc_311 (25G mode)
     CLOSED: [2018-06-25 Mon 14:13]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 14:13]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 14:06]--[2018-06-25 Mon 14:07] =>  0:01
     CLOCK: [2018-06-25 Mon 12:00]--[2018-06-25 Mon 12:04] =>  0:04
     CLOCK: [2018-06-25 Mon 11:51]--[2018-06-25 Mon 11:57] =>  0:06
     CLOCK: [2018-06-25 Mon 11:13]--[2018-06-25 Mon 11:26] =>  0:13
     CLOCK: [2018-06-25 Mon 10:40]--[2018-06-25 Mon 10:55] =>  0:15
     :END:      
**** DONE normal traffic with termail loopback tc_310 (100G mode) tc_312 (25G mode)
     CLOSED: [2018-06-25 Mon 14:34]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 14:34]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 14:29]--[2018-06-25 Mon 14:34] =>  0:05
     CLOCK: [2018-06-25 Mon 14:07]--[2018-06-25 Mon 14:13] =>  0:06
     CLOCK: [2018-06-25 Mon 12:05]--[2018-06-25 Mon 12:17] =>  0:12
     CLOCK: [2018-06-25 Mon 11:01]--[2018-06-25 Mon 11:09] =>  0:08
     :END:      
**** DONE tc_309 re-run TCs when desinger fixing bug. (The bug: arbitration cannot always correctly work when normal traffic and lpbk traffic are valid in the same time.)
     CLOSED: [2018-07-16 Mon 14:03]
     - State "DONE"       from "STARTED"    [2018-07-16 Mon 14:03]
     :LOGBOOK:  
     CLOCK: [2018-07-05 Thu 11:36]--[2018-07-05 Thu 12:01] =>  0:25
     :END:      
     re-run tc_309,<2018-07-05 Thu 12:09> result:
     normal traffic is 50G, 900 packets, all output.
     loop traffic is 50G, 900 packets, just half output. it's not expected. haidong is checking on it. <2018-07-05 Thu 12:11>
**** DONE NGMII interface input the illegal traffic
     CLOSED: [2018-06-25 Mon 17:28]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 17:28]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 16:37]--[2018-06-25 Mon 17:28] =>  0:51
     CLOCK: [2018-06-25 Mon 14:21]--[2018-06-25 Mon 14:29] =>  0:08
     CLOCK: [2018-06-25 Mon 11:57]--[2018-06-25 Mon 12:00] =>  0:03
     :END:      
     tc_020, ngmii driver gen 70% phy errors.
**** DONE CGMII interface input the illegal traffic
     CLOSED: [2018-06-25 Mon 18:36]
     - State "DONE"       from "STARTED"    [2018-06-25 Mon 18:36]
     :LOGBOOK:  
     CLOCK: [2018-06-25 Mon 17:28]--[2018-06-25 Mon 18:36] =>  1:08
     :END:      

*** DONE update the cmac lbus monitor, if rx_rdy is 0 and sop has been valid, max allow 4.
    CLOSED: [2018-07-05 Thu 11:34]
    - State "DONE"       from "STARTED"    [2018-07-05 Thu 11:34]
    :LOGBOOK:  
    CLOCK: [2018-07-05 Thu 10:33]--[2018-07-05 Thu 11:00] =>  0:27
    CLOCK: [2018-07-05 Thu 09:56]--[2018-07-05 Thu 10:08] =>  0:12
    :END:      
** DONE sys side traffic packet with ITMH/OTMH [100%]
   CLOSED: [2018-07-11 Wed 14:46]
   - State "DONE"       from "STARTED"    [2018-07-11 Wed 14:46]
   :LOGBOOK:  
   CLOCK: [2018-07-05 Thu 09:32]--[2018-07-05 Thu 09:56] =>  0:24
   :END:      
*** DONE the eth_agent need one more layer after ethernet layer before phy layer.
    CLOSED: [2018-07-06 Fri 14:45]
    - State "DONE"       from "STARTED"    [2018-07-06 Fri 14:45]
    :LOGBOOK:  
    CLOCK: [2018-07-05 Thu 14:33]--[2018-07-05 Thu 16:09] =>  1:36
    :END:      
*** DONE the eth_object_parser need parser OTMH.
    CLOSED: [2018-07-09 Mon 18:41]
    - State "DONE"       from "STARTED"    [2018-07-09 Mon 18:41]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 18:27]--[2018-07-09 Mon 18:41] =>  0:14
    CLOCK: [2018-07-09 Mon 11:44]--[2018-07-09 Mon 11:50] =>  0:06
    CLOCK: [2018-07-06 Fri 14:57]--[2018-07-06 Fri 15:16] =>  0:19
    :END:      

*** DONE CGMII IF ADVA HDR test
    CLOSED: [2018-07-10 Tue 18:48]
    - State "DONE"       from "STARTED"    [2018-07-10 Tue 18:48]
    :LOGBOOK:
    CLOCK: [2018-07-10 Tue 16:17]--[2018-07-10 Tue 18:48] =>  2:31
    CLOCK: [2018-07-10 Tue 14:48]--[2018-07-10 Tue 14:56] =>  0:08
    :END:
**** DONE tc_006m IGRESS (CGMII TX) test, CGMII IF ADVA HDR support. 
     CLOSED: [2018-07-11 Wed 14:46]
     - State "DONE"       from "STARTED"    [2018-07-11 Wed 14:46]
     :LOGBOOK:  
     CLOCK: [2018-07-10 Tue 18:54]--[2018-07-10 Tue 19:13] =>  0:19
     :END:      
     CGMII_TX monitor need add the fcs re-calc function.
     eth_object_parser need add the adva hdr support mode.
** DONE Help Atlanta Mike check the T_dcn_switch_v1.0_r112857 regression results [100%]
   CLOSED: [2018-07-10 Tue 12:25] DEADLINE: <2018-07-12 Thu>
   - State "DONE"       from "STARTED"    [2018-07-10 Tue 12:25]
   :LOGBOOK:  
   CLOCK: [2018-07-09 Mon 14:22]--[2018-07-09 Mon 14:47] =>  0:25
   :END:      
*** DONE dcn_switch tc_009 checking, ATL 13 errors, SZX no errors
    CLOSED: [2018-07-10 Tue 12:24] SCHEDULED: <2018-07-09 Mon>
    - State "DONE"       from "STARTED"    [2018-07-10 Tue 12:24]
    :LOGBOOK:  
    CLOCK: [2018-07-09 Mon 14:47]--[2018-07-09 Mon 15:21] =>  0:34
    :END:      
    after double checking the tc009 from Mike, the ATL run tc_009 with 1 ETH 9 FRMs mode. However, SZX run tc_009 with 2 ETHs 8 FRMs mode. double checking the svn log, it has been said on 2017-09-27 r107278, For tc_009, the default is 2 ETH port test.
    ../../../scripts/run_sim_questa -local_output off -database local_db
    -set_ethernet_port 2
** STARTED update sys-sim.mk base on xgPro style.
   :LOGBOOK:  
   CLOCK: [2018-07-20 Fri 16:24]--[2018-07-20 Tue 18:25] =>  2:01
   CLOCK: [2018-07-20 Fri 15:01]--[2018-07-20 Fri 15:31] =>  0:30
   CLOCK: [2018-07-11 Wed 18:01]--[2018-07-11 Wed 18:32] =>  0:31
   :END:      
 
** STARTED on Wednesday, regression the short time running testcase
   :LOGBOOK:  
   CLOCK: [2018-07-25 Wed 09:45]--[2018-07-25 Wed 10:52] =>  1:07
   :END:      
*** DONE termnal loop mode, blocked packet should be counter by eth_stat, tc_301 pass 
    CLOSED: [2018-07-20 Fri 11:09]
    - State "DONE"       from "STARTED"    [2018-07-20 Fri 11:09]
    :LOGBOOK:  
    CLOCK: [2018-07-20 Fri 09:05]--[2018-07-20 Fri 09:48] =>  0:43
    :END:      
*** DONE tc_202 pause has own couter in RMON, shoud not count by Mcast. whatever pause action in mac rx [50%]
    CLOSED: [2018-07-19 Thu 18:52]
    - State "DONE"       from "STARTED"    [2018-07-19 Thu 18:52]
    :LOGBOOK:  
    CLOCK: [2018-07-19 Thu 17:56]--[2018-07-19 Thu 18:52] =>  0:56
    :END:      
** DONE tc_007 double check. has fatel error. After cleanup the defines in tb_env.sv, the fatel has gone.
   CLOSED: [2018-07-19 Thu 16:28]
   - State "DONE"       from "STARTED"    [2018-07-19 Thu 16:28]
   :LOGBOOK:  
   CLOCK: [2018-07-19 Thu 15:43]--[2018-07-19 Thu 16:28] =>  0:45
   :END:      
** DONE add tc_007a to test plan
   CLOSED: [2018-07-19 Thu 16:34]
   - State "DONE"       from "STARTED"    [2018-07-19 Thu 16:34]
   :LOGBOOK:  
   CLOCK: [2018-07-19 Thu 16:29]--[2018-07-19 Thu 16:34] =>  0:05
   :END:      
** STARTED all port have normal + loop traffic (some vlans are loops, some vlans are normal) test.[66%]
   :LOGBOOK:  
   CLOCK: [2018-07-20 Fri 13:40]--[2018-07-20 Fri 14:21] =>  0:41
   :END:      
   loop + normal + y1564 gen. (if egress + pause + dying gasp gen)
   The PRI is: dyinggasp > pause > normal traffic > loop > y1546 
*** DONE tc_410 25G mode in pipe1, 100G mode in pipe0 (ku5p)
    CLOSED: [2018-08-23 Thu 11:10]
    - State "DONE"       from "STARTED"    [2018-08-23 Thu 11:10]
    :LOGBOOK:  
    CLOCK: [2018-08-23 Thu 09:51]--[2018-08-23 Thu 11:08] =>  1:17
    CLOCK: [2018-08-22 Wed 18:03]--[2018-08-22 Wed 18:46] =>  0:43
    CLOCK: [2018-08-22 Wed 17:44]--[2018-08-22 Wed 17:54] =>  0:10
    CLOCK: [2018-08-22 Wed 16:53]--[2018-08-22 Wed 17:17] =>  0:24
    :END:      
    pipe0 100g mode, the y1564 gen must prov to single mode. 
    ingress(up) y1564 gen disable, because it output from cgmii, cgmii don't calc FCS, eth_object_parser will report useless uvm_error.
    egress (down) y1564 gen is normal.

